{
  "title": "Azur Arc",
  "date": "14 ABD",
  "content": "Reports of a new spice strain, dubbed Azur, begins going viral across the galaxy. \nThe manfacturer of this drug is unknown.\n\nReports of extremely suspicious activity are made on Crucible Prime.\n\n4 Azur dealers arrive on the planet of Crucible Prime, many members of the Order attempt to try the substance, with one member of the Sphere of Laws & Justice overdoses and is quickly brought into recovery. \n\nAfter the murder of 2 of these dealers, an advancement is finally made by Darth Saevus.\n\nDarth Themis on the other hand, becomes addicted to the substance. \n\nRegardless of how the situation was handled, dealing empires being able to give out these substances on Sith homegrounds is undoubtably concerning. Many Sith come to the conclusion that the situation was handled poorly by the Sphere of Laws & Justice. \n\nReports of an Azur producing vessel near Crucible Primes atmosphere are sent in. It seems whoever is responsible for the production and distribution of Azur was not aware of the previous events. The Sphere of Laws and Justice is ordered to raid the ship and gather as much information regarding the dealers of Azur as possible.\n\nThe Sphere of Laws and Justice rallies in preparation of the raid.\n\nThe Sphere of Laws and Justice successfully captures the lead scientist of the Azur production vessel. They begin a public interrogation in the Chamber of Judgement. \n\nThe Sphere of Laws and Justice completes their mission, which is generally regarded as a success. The mission started slow, with the mysterious vessel almost seeming like a regular party cruiser. The Sith on board had a hard time gaining any progress, yet stood their ground and continued investigating. One Sith, Apprentice Mal9JMH grabs a handful of Azur, and accidentally inhales some of it, causing an almost immediate overdose. Their body was recovered and they were successfully resuscitated after the mission. \n\nAfter a period of 0 progress, the Sith realize that the security detail within the vessel is rather high and begin to plan ways to deal with them so they can adequately investigate the area. They eventually knock out 2 guards, forcing Azur down the throat of one of them. One guard walks in and sees the destruction caused, he immediately begins firing shots. The vessel quickly breaks out into pure chaos, and shots are fired in every direction. It is estimated that 4 members of the Sphere of Laws and Justice were killed in this incident. During the chaos, the Network Leader of the ship evacuates through an escape pod, unbeknownst to the Sith. \n\nThe chaos on the ship naturally causes Sith to begin searching all areas of the vessel, leading to an underground Azur laboratory. Inside of this laboratory, millions of credits in Azur can be found, along with thousands of credits in science equipment and Azur ingredients. Had a galactic law enforcement like the Republic stumbled upon this, it would be one of the largest drug busts in history. Inside of the laboratory were a couple dozen scientists and a lead scientist, a Chiss male. The regular scientists were not spared, however the Chiss was brought in for Interrogation. \n\nThe Sphere of Laws and Justice issues a public interrogation of the individual, causing dozens of Sith to line up outside the Chamber of Judgement to witness the event. The scientist reveals loads of information regarding the 'Torvo Family', the family allegedly behind all of the previous Azur related incidents. He talks about 'The Chemist', who he explains is the one responsible for perfecting Azure’s primary recipes, along with having started the Family’s process of producing and manufacturing the drug, having managed to do so with the collaboration of other chemists he invited into the scheme, having created a network of his own to keep the production of Azure in a steady pace without any hiccups. He also talks about the 'Skullcrusher'. He briefly mentions him, however it seemed that as soon as he began talking about him a visible shift in tone was made. The Chiss Scientist would go on a little longer about family operations, shortly before killing himself with a cyanide pill.\n\nAn unmarked ship enters Crucible Primes atmosphere, it is quickly flagged down by Imperial Intelligence and plans to meet it upon landing are made. It's estimated arrival time is in 10 minutes.\n\nThe vessel begins rapidly approaching land.\n\nA shuttle lands, and a package is quickly dropped off.  The delivery man says little about the package, though that seems to be due to a genuine lack of knowledge rather than secrecy. The package is... ripped open by numerous lightsabers, causing the contents to be nearly destroyed. Despite that, the Sith begin inspecting the head and come to a realization. The person delivered was the Operation Leader of Laws & Justices previous drug bust. It seems that whoever was in charge wanted to make a point. Though before Sith can continue investigation, an automated holo-message plays. \n\nHello, Sith! I am Silvertongue, you probably do not know me, although I'm not entirely sure what that good-for-nothing chemist told you all before he bit the dust, so maybe you actually do know me.\nRegardless, I send you this lovely gift along with this holographic recording of me so I can tell you all a message: \nThe Family is well aware about what happened on Crucible Prime, and what you people have done to one of our cruisers recently. \nThe Family is heavily appreciative of the current status of peace we have, and we would like this to remain the same in the forseeable future,\nTherefore, conflict with outsiders who have no matter in our affairs and businesses is not appreciated in any way.\nWe wholeheartedly ask of you people to stop your efforts. As far as I know about you lot, you, just like us, wish to not be bothered, and to be left alone with your own business. \nThe Family simply asks of you to do the same with us.\nHowever, if you so insist on keeping your investigation, then I'm afraid that our diplomacy will have to become a bit more harsh.\nAlas, consider this rascal's head a gift to demonstrate our appreciation, and better yet, a warning. \nMessing with the Family's business will be a path you will not be able to get out of once you get further into it, \nConsider us to be kind enough to turn our eyes blind to the previous ordeals you've had with our business.\n\nThis encounter leaves a lot of tension for the Sith present, and the question of where to move forward from here is prompted. Ultimately, that decision lays with the Sphere of Laws & Justice.\n\nThe Sphere of Laws and Justice's Inner Circle, specifically Darth Zodek , plan to convene and discuss where to move forward with the unfamiliar 'Torvo Family'. A threat, or rather an invitation, is directed towards the Sphere and the usage of Azur within the Sith Order continues to become a problem, with notable figures like Darth Themis struggling to pause usage. \n"
}