{
  "title": "Imperial Arc",
  "date": "2 ABD",
  "content": "Tensions continue to rise as Lieutenant Jones threatens his own defendant.\n\nCommander Gilbert orders his men to fire at Lieutenant Jones after he is sentenced to death, however before he can react his own men begin attacking the Sith! An explosion is placed against a wall before the Imperial traitors are quickly evacuated.\n\nCommander Gilbert makes a promise to find these men, and to prevent a situation like this from occuring again.\nSoldiers watch from the broken wall, upset at the previous events.\n\nAfter a week of radio silence regarding the rogue Imperial situation, a massive update is made for the worst. 2 days ago Republic soldiers stationed on Naboo would stumble upon a massive arms operation in an abandoned manor, run by none other than the Imperials. Reports say they were attempting an underground arms enterprise as a means to make money, unfortunately for them they were caught rather quickly.\n\nAdding the illegal gun charges as well as the many other war crimes Lieutenant Jones has committed in conjunction with the other Imperials, he was easily facing life in jail to death. After a top secret meeting on a Republic starship, a plea deal was offered to Jones. The location of the Sith home-world as well as the database on the strongest Sith officials - otherwise known as the Archives. \n\nA hearing will be held sometime in the next week, where Lieutenant Jones will be revealing all known information on the Sith database to the Galactic Republic, possibly causing an all out war. \n\nIf the Sith Order fails to stop him, the location of Crucible Prime will be known to everyone across the galaxy, as well as all Archive information.\n\nReports of loud noises and music become rapidly sent in near the Tombs of Korriban by Imperials, Overseers, and Acolytes alike. Imperial soldiers stationed on the planet begin recalling many upper class shuttles entering and exiting orbit. \n\nTwo Imperial soldiers would be sent to investigate the matter, only reporting a large red wall. Further investigation will be carried out shortly.\n\nThe events on Korriban continue even a week later with an alarming update. The body of one of the Imperials sent to the area would be found only a few miles from the checkpoint sighting. He would be stripped of his gear and roughly damaged, visible by his scattered limbs... As well as the gruesome sighting, traces of Azur and numerous liquors could be found on his body. \n\nWhile the events surrounding this new structure are unknown, it becomes apparent that it needs to be destroyed. The existence of this area places Acolytes at risk which is very much apparent, despite most members of the order disregarding the death of the Imperial due to their poor reputation. The Sphere of Defense & Security has been tasked with exterminating this threat as soon as possible.\n\nMeanwhile, Lieutenant Jones continues to sit in the Republic cell. Rumor has it his trial is imminent due to the constant threat of his safety, however no updates are made by the Sphere of Expansion & Diplomacy to catch him. \n\nThe following picture has been revealed by the Sphere of Laws & Justice following their investigation on the dead Imperial.\n\nThe Sphere of Defense and Security prepare to enter the Korriban wilds, ready to take down the hostile threat.\n\nThe Sphere of Defense and Security conclude their expedition to the Korriban wilds, which ends in what the Sith conclude as a victory. Upon arrival the Sith would discover a checkpoint, where they would be questioned by a security guard regarding their presence on the land. The Sith are sent in a room for a 'screening', which they are extremely skeptical of and intentionally leave a few Sith out to explore. Upon entering the room, an emergency shut off would prompt and most of the Sith would be trapped in the room with the Sith not in the room being forced to engage and kill 2 other security guards. The Sith in the room are interrupted by a message fromt he Ringmaster, where he introduces himself as the Ringmaster, or Gregory. The Sith in the room would be gassed shortly after the guards are killed, where they would wake up in a jail cell.\n\nUpon waking up in the jail cell, the Sith would be taunted by 3 security guards continuously with one Sith titled Jakeou713 being called 'chopped' multiple times by the security guards. One Sith recited the Sith code multiple times (aymansocius)  , prompting a security guard to ask if he is schizophrenic. Despite multiple attempts to break out, including an almost successful attempt by Darth Lividus the Sith are once again knocked out, where they would shortly after regain consciousness in a large arena. \n\nUpon entering the arena, the sound of screams and music was extremely apparent. The Sith would be dropped down after an egotistic monologue by the Ringmaster. Upon dropping down, the Sith would be jumped by an array of species, including a large and powerful Wampa. The Wampa would kill multiple members of the <@&1138631551542906890> but namely **Lord Zeus** || <@513587942569148456> ||, who received near fatal wounds from the Wampa. In a quick attempt of revival, all of the Spheres healers would channel their energy into his lifeform, reviving him back to a healthy state. Finally the 'Champion of the Ring' would be deployed, causing a large amount of damage to the Sphere, however would die quickly as well. \n\nAfter the fight sequence the Sith would be once again subject to the gas substance, however this time 2 Sith, **Apprentice jdrinky** and **Lord Zeus** , would find air pockets; successfully retaining their consciousness. Shortly after, 3 security guards would enter and begin moving bodies, but not before quickly being stopped by the Sith faking unconsciousness. The guards would be killed and the Sith would move throughout the caves. \n\nThe Sith would arrived at the Ringmasters office, where they'd attempt to mind trick the guards but be interrupted by a guard they let live back at the arena. A large fight would break out in the hallways, ultimately leaving the Sith victorious. On the bodies, 2 keycards are found and the door to the Ringmasters office is opened.  The Ringmaster is apprehended and arrested, where he is questioned about who sent him and where his mother lives.\n\nA hit squad would be sent to gregs mothers house, where she would be brutally murdered by the squad led by Apprentice jdrinky.\n\nThe time for Lieutenant Jones's trial is released to the public and scheduled for some time tomorrow. The Sphere of Sith Philosophy is quickly assigned to the case, where they will be infiltrating the republic jury and killing Jones before he can reveal vital information regarding the Sith Order. Failure of this operation would be detrimental to the Order and cause a large hiccup in its advancements technologically and socially.\n\nThe Sphere of Sith Philosophy begin their infiltration of Jones's court trial. Their journey begins at a pre-party, where many dance and interact with party goers.\n\nThe Sphere of Sith Philosophy's infiltration mission is completed, and the results of the mission are extremely controversial. The mission begins successfully, with a smooth infiltration of the pre-party and almost 0 suspicion built around the group. Darth Zenith is almost kicked out of the party for getting on stage and interrupting the mariachi bands performance. Not much goes on at the party and no leads are found, except for a man giving out loads of pure Azur, which the Sphere refuses to consume. Shortly into the party, the shuttle to the court room arrives, and the Sphere of Sith Philosophy as well as the rest of the Republic jury begin transport to the trial of Lieutenant Jones. One Sith, Zealot Shiaholder1 is left behind after refusing to sit next to an alien. \n\nThe transport lands at the courtroom and the trial quickly begins. The judge begins to lay out the charges and Jones is brought to the stand to enact his plea deal and reveal extremely vital information regarding the Sith Order. Meanwhile, Zealot Shia begins to massacre everyone at the party. Most attendees run for their lives, however due to a large number of them being extremely intoxicated, their efforts are relentless. Everyone at the party is confirmed dead. The trial continues on, and Jones begins to reveal the location of the Sith homebase. Jones reveals the location of the Sith home-world, as for reasons unknown, the @Sphere of Sith Philosophy refuses to engage Lieutenant Jones. Shortly after Crucible is revealed, the Sphere begins their massacre and attempts to kill everyone at the court, starting with Jones. Shaman PresidentStorm is prenounced as the Sith that slayed Lieutenant Jones.  It is presumed that everyone was killed, however not confirmed.  \n\nOverall, the Order high command is incredibly displeased with the Sphere of Sith Philosophy's performance. What should have been a quick infiltration was spoiled as the Sphere allowed Jones to reveal the Sith home-world. While it is believed everyone in the court was killed, such a leak was still a huge mess up on the Spheres end, and it is unknown if the Sphere will have any more missions assigned to them for the near future. It is likely that the @Sphere of Defense and Security  will be assigned a reconnaissance mission to ensure any recordings or possible leaks of the trial information is erased. "
}