  {
    "title": "Rite of the Kaggath",
    "author": "Orpheus1190",
    "category": "Order Information",
    "date": "24 ABD",
    "content": "<br><span style='font-size:20px; font-weight:bold;'>Overview</span><br><br><div>The Rite of the Kaggath is an ancient rite of the Sith, originating from the tribes of Korriban to claim power or possessions from other people, or otherwise settle disputes. Kaggaths require not only pure strength, but also wits, strategy, and determination to claim your place amongst the Tapestry of the Order as something more than just an average member of the Order. The Kaggath is split into two parts: the battle of strength and the battle of wits. Kaggaths have a total of 131 points to be awarded within the two parts, 66 for the battle of strength, and 65 for the battle of wits. The Rite of the Kaggath is hosted by Alchemists of the Sphere of Sith Philosophy’s Path of Tradition. \nThe Kaggath\nThe Battle of Strength is the first part of a Kaggath, made up of two parts: first, a set of six duels, the challenger versus the challenged, which are worth six points each, then a set of five team battles featuring the powerbases of both sides, which are also worth six points to the winning powerbase. These battles test the strength and combat prowess of the two parties to show their worth, not only as a display of strength, but to show they’re better than their opponent.\nThe Battle of Wits is the second part of a Kaggath, made up of two parts. Firstly, ten questions about the history and structure of the Sith Order are asked, each worth four points. Then, five more questions are asked about the philosophy and lore of the order, being sourced from the archives; these questions are worth five points each. Depending on the accuracy of the answer, points may be removed for that answer; this applies to both sections of the Battle of Wits.\n<br><span style='font-size:20px; font-weight:bold;'>Tiers and Stipulations</span><br>\n<div>Kaggaths are hosted by the Sphere of Sith Philosophy’s Alchemists and moderated by Sith Archons, a part of the Court of the Dark Lord. These two groups work in tandem with the Dark Council to ensure everything runs smoothly and is fair and free of bias. Alchemists are in charge of creating the questions for the Battle of Wits, as well as hosting the event. Archons are specifically moderators; they check over the questions for bias and make sure the event is fair for both parties.\nThere are multiple different forms of Kaggath you may see, each with various causes, stipulations, and attendees. There are the common Humiliation Kaggaths or tier I Kaggaths, Subjugation Kaggaths, which are tier II, and finally Domination Kaggaths, which are tier III. \nHumiliation Kaggaths, also known as tier I Kaggaths, are the most common type of Kaggath,  typically fought between two Advanced Sith Knights (ASK for short). These are usually fought to prove your worth and superiority over the other party. The potential rewards for this Kaggath are stealing the opponent’s kyber crystal of your choosing, powerbase vassalization, or thrall servitude. \nSubjugation Kaggaths, also known as tier II Kaggaths, are the second most common type of Kaggath, where traditionally an Advanced Sith Knight is pit against a Sith Lord. These are fought when a subordinate believes their superior isn’t doing their job correctly, and that they could do a better job. The most common reward for this tier of Kaggath is a rank steal, be it the rank of Lord itself, their Sphere role, or their role within the Court of the Dark Lord. \nDomination Kaggaths, otherwise known as tier III Kaggaths, are the rarest type of Kaggath, being fought between two Spheres or members. However, the latter of these two can only be declared by a Tormentor within the Court. This type of Kaggath can only be declared by a Sphere overlord, or in rare cases, a member of the  Sphere’s Inner Circle (IC), with the Overlord's permission. The rewards for this type of Kaggath are generally humiliation or vassalization of the Sphere for another Domination Kaggath; however, another potential outcome is perma-death, which can only be done if a Tormentor has declared the Domination Kaggath.</div>"
  }
