{
  "title": "Sith Marks",
  "author": "Orpheus1190",
  "category": "Order Information",
  "date": "24 ABD",
  "content": "<div class='subtitle'>Overview</div>\n\nSith Marks, also known as accolades, are awards handed out by members of the Dark Council, except “The Dark Lord’s Favor”, given to those who have excelled within a specific field in the Order and thus have been awarded for it. There are two types of Sith Marks given out, Dark Council Marks, which are commonly given out by the Dark Council, and Prestigious Recognitions, which are rarely given out with the agreement of the entire Dark Council, or in the case of “The Dark Lord’s Favor”, the Dark Lord themself. These accolades mean you have proven loyalty and your skill to the \nleadership of the Sith, as well as the Order as a whole. \n\n<div class='subtitle'>Dark Council Marks</div>\n\nThe Dark Council Marks are accolades given out by the Dark Council, for varying reasons, typically associated with a skill or action the bearer has done to prove themself worthy of it. \nThe first mark is the “Mark of Activity”, awarded to those who have proven themselves active both in-game and in their general duties. This accolade is given to those who have dedicated themselves to their Sphere work and also serve as an example to attend in-game events and showcase their activity. The people with this mark are the people you will commonly see around Crucible Prime, hosting events, or doing Sphere tasks. \n\nThe “Mark of Combat Prowess” is awarded to those who showcase immense strength and strategy in battle, typically being given out to those who prove themselves in competitions hosted by the Order, such as “Warmonger of the Sith”, or by proving their combat abilities in front of the entire Order in events such as raids or lore events. The wearers of this accolade are typically in combat Spheres, being seen commonly training in Dueling Chambers, the Pit, or in a combat Sphere dojo. \n\nThere is also a knowledge-based accolade, the “Mark of Dark Knowledge“, given to those who show exceptional knowledge in Sith Philosophy, history, and lore. The people with this accolade have \nproven themselves eligible for this award by frequently winning events such as “Chronicler of The Sith” or “Philosopher of The Sith”, showcasing their knowledge and writing ability in the greater Order. \n\nFor the leaders of the Order, there is the “Mark of Leadership”. This accolade is obtained by those who have proven themselves a wise and respectable leader, either in their Sphere or the Order as a whole. Typically, this accolade is awarded to those in higher leadership positions in their Sphere, like Inner Circle members, or in high positions in the Order as a whole. Those who have this mark are those you will see helping their fellow Order members, and teaching the future generations of the Sith, both in their Sphere and the Order. \n\nFinally, there is the “Mark of Loyalty”, bestowed upon those who have shown their dedication to the Sith Order and their Sphere. This accolade is typically given to those who have remained loyal to the Order for great lengths of time and have progressed through its ranks. Those who have this accolade are normally veterans of the Order and have been congratulated for their feats; you will likely see them in leadership positions as well. \n\n<div class='subtitle'>Prestigious Recognition Marks</div>\n\nThe accolades in the “Prestigious Recognition” category are the rarest accolades given to a member of the Sith Order. The people with these marks have proven their worth either to the entire Dark Council or the Dark Lord through dedication and hard work. \n\nThe first prestigious mark is “Defender of the Order”, given out by the Dark Council for outstanding combat ability, leadership, and dedication to the Order. The members with this accolade have \nproven themselves to the Dark Council through their influence inside the Order and their commitment. A unanimous vote from the Dark Council decides who receives this accolade.\n\n“The Dark Lord’s Favor” is a mark given out by the Dark Lord themself, through whatever means they decide is deserving of the accolade. This accolade is generally only given to the most influential and powerful people of the Order, such as Powerbase members. \n"
}