{
  "title": "The Triumph of Darth Thanatos",
  "author": "Orpheus1190",
  "category": "Historical Events",
  "date": "24 ABD",
  "content": "<div class='subtitle'>The Death of Darth Viserion</div>\n<div>Darth Viserion, former Sphere of Sith Philosophy Overlord, was killed in battle in 21 ABD during a raid by the Sepulchral Legion, ancient Sith led by Nodt, after the opening of a cursed Holocron found on Thule, recovered from the eternal host. Sacrificing himself, he managed to not only seal the holocron but lift the curse of everyone, saving not only many Sith lives, but Crucible Prime itself.</div>\n<div class='subtitle'>The Race For Philosophy Overlord</div><div>With no time to grieve their former Overlords' demise, the Sphere of Sith Philosophy’s Inner Circle was immediately thrust into a Subjugation Kaggath by the Powerbase, the strongest of which would become the new Overlord of the Sphere, the four immediately accepting the Powerbase's challenge. Darth Zenith, Headmaster of The Sith Academy, Lord Framis, Keeper of Philosophy, Lord PresidentStorm, Architect of Revelation, and finally, Darth Thanatos, Ritualmaster. These four brave sphere members would now fight each other for the rank of Overlord, but only one would come out on top.</div>\n<div class='subtitle'>The Kaggath</div>\n<div>Pledges rolled in for every member except Lord Framis, Lord PresidentStorm taking a very early lead in numbers, with Darth Thanatos not far behind, and Darth Zenith with a respectable number of supporters. This continued up until the day of the Kaggath, the battle for Overlord, which was held in a hidden, underground arena. The Dark Council, led by Lord Voice, Darth Achilles, hosted the Kaggath, rallying Sith from across the galaxy to attend to watch the newest member of the Dark Council rise to glory, and so it began. Everyone gathered in the stands of the arena, waiting to see the new overlord be chosen. The Battle of Wits began shortly, with its questions having been taken from the Archives, the participants were asked to provide answers about the lore of the Order, as well as its history. Eventually, the Battle of Wits, with no clear winner as everyone had equally proven their knowledge of the lore and history of the Order, was over. The Battle of Strength was next, starting with duels, a Free-For-All event between the four Inner Circle members. Several rounds passed with Darth Thanatos consistently coming out on top against his peers, with Lord Framis managing to win one duel. By this time, Thanatos had a significant lead over the rest of the Inner Circle, gaining the favor of the crowds. Swelling with excitement, they moved on to the Team Deathmatch event, Powerbase versus Powerbase, a showcase of not only their strength but the loyalty they had earned as well. Their Powerbases were ready to fight: Darth Zenith, Lord Presidentstorm, and Darth Thanatos rallied their members, encouraging them for battle, while Lord Framis stood alone in his corner, an underdog. The event began, Lord Framis slowly but surely being wiped out, overwhelmed by the pure might of the other three Inner Circle members' Powerbases, despite his survival attempts. As soon as it began, it ended. Overwhelming both his opponents, Darth Thanatos led his Powerbase into battle, facing the other three Inner Circle members head-on, winning not only with his strength, but his followers’ unwavering loyalty and numbers. The Battle of Strength had ended, and with Darth Thanatos in the lead, everyone had proved their strength. Thus, the race for Overlord of the Sphere of Sith Philosophy ended, a new Dark Council member chosen, inducted by Lord Will, Darth Zinwrath; Darth Thanatos would go on to lead the Sphere.</div>"
}